# Исходный список
my_list = [42, 69, 322, 13, 0, 99, -5, 9, 8, 7, -6, 5]

# Индекс для цикла
i = 0

# Пустой список для положительных чисел
new_numbers = []

# Цикл while
while i < len(my_list):
    number = my_list[i]
    if number < 0: # Прерываем, если число отрицательное
        break
    elif number > 0: # Добавляем, если число положительное
        new_numbers.append(number)
    i += 1 # Переход к след. числу / Шаг

# Результат
print("Список положительных чисел до первого отрицательного:", new_numbers)