#1.Ввод строки с произвольным текстом
my_string = input("Напишите строку ")

#2.Вывод количества символов в строке
print("Количество символов:",len(my_string))

#3.Работа с методами строк
#В верхнем регистре
print("В верхнем регистре: ",my_string.upper())

#В нижнем регистре
print("В верхнем регистре: ",my_string.lower())

#Удаление всех пробелов
print("Строка без пробелов: ",my_string.replace(" ",""))

#Вывод первого символа строки
print("Первый символ: ",my_string[0])

#Вывод последнего символа строки
print("Последний символ: ",my_string[-1])